package chap06;

public class ObjectStudy {
/*
 * <객체 지향 프로그래밍>
 * 객체란?
 * 물리적으로 존재하거나 추상적으로 생각할 수 있는 것 중에서 자신의 속성을
 * 가지고 있고 다른 것과 식별 가능한 것.
 *
 * 객체는 속성과 동작으로 구성되어 있다.
 * 자동차로 치면 색깔,속도 같은 속성은 필드라고 부르고
 * 달린다, 멈춘다 같은 동작은 메소드라고 부른다.
 *
 *객체들은 각각 독립적으로 존재하고, 다른 객체와 서로 상호작용을 하면서 동작한다.
 *객체들 사이의 상호작용 수단은 메소드이다.
 *객체가 다른 객체의 기능을 이용하는 것이 메소드 호출이다.
 *
 *"." 연산자는 객체의 필드와 메소드에 접근할 때 사용
 *ex) 리턴값 = 객체.메소드(매개값1, 매개값2, ...);
 *
 *매개값은 메소드를 실행하기 위해 필요한 데이터이다.
 *예를들어) 10과 20을 주고 더하기 기능을 이용한다라고 했을 때 10과 20이 더하기 기능의 매개값이다.
 *
 *리턴값은 메소드가 실행하고 나서 호출한 곳으로 돌려주는 값이다.
 *ex) int result = Calculator.add(10,20);
 *                  <====== 리턴한 값을 int 변수에 저장
 *
 * <객체와 클래스>
 *
 * 객체는 설계도를 바탕으로 만들어진다.
 * 메모리에서 사용하고 싶은 객체가 있다면 설계도로 해당 객체를 만드는 작업이 필요하다
 * 그 설계도가 class이다.
 * 클래스에는 객체를 생성하기 위한 필드와 메소드가 정의되어 있다.
 * 클래스로부터 만들어진 객체를 해당 클래스의 ****인스턴스****라고 한다.
 * => 자동차 객체는 자동차 클래스의 인스턴스 라는 말과 같은 동향
 * 클래스로부터 객체를 만드는 과정을 인스턴스화라고 한다.
 * 하나의 클래스로부터 여러개의 인스턴스를 만들 수 있다.
 * 
 * 객체 지향 프로그래밍 개발은 세가지 단계가 있다.
 * 1) 클래스를 설계해야한다.
 * 2) 설계한 클래스를 가지고 사용할 객체를 생성해야 한다.
 * 3) 생성된 객체를 이용한다.
 * 
 * 
 * <클래스 선언>
 * 
 * 사용하고자 하는 객체를 구상했다면, 그 객체의 대표 이름으로 클래스 이름을 짓는다.
 * 일반적으로 소스 파일 하나당 하나의 클래스를 선언하지만,
 * 두 개 이상의 클래스 선언도 가능하다.
 * => 클래스를 여러개 선언하면 컴파일 했을 때, 파일이 여러개 생김
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 *
 *
 */


}
