package chap06;

// 패키지 메모

public class PackageStudy {

  /*클래스를 체계적으로 관리하기 위해서 패키지를 사용한다.
   *
   * 우리가 폴더를 만들어 파일을 저장 관리하듯이 패키지를 만들어 클래스를 저장 관리한다.
   *
   * 패키지는 단순히 파일 시스템의 폴더 역할을 하는것이 아니라 클래스의 일부분이다.
   *
   * 패키지는 클래스를 유일하게 만들어주는 식별자 역할을 한다
   * => 클래스 이름이 동일 하더라도 패키지가 다르면 다른 클래스로 인식하기 때문
   *
   * => 클래스만 따로 복사해서 다른 곳으로 이동하면 그 클래스는 사용할 수 없음
   *
   * package 상위패키지.하위패키지;
   * 모두 소문자로 작성하는 것이 관례
   *
   *
   * 여러 개발 회사가 함께 참여하는 대규모 프로젝트나, 다른 회사의 패키지를 이용할 경우
   * 패키지 이름이 중복될 가능성이 있다.
   * 그래서 회사들 간에 패키지가 중복되지 않도록 흔히 회사의 도메인 이름으로 패키지를 만든다.
   *
   * ex) com.samsung.projectname
   * ex) org.apache.projectname
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   */



}
