package chap05;

public class DatatypeStudy {
 /*
  자바의 데이터 타입은 2종류로 분류된다
  1. primitive type = 원시타입, 기본타입
  2. reference type = 참조타입

  1)기본타입
  -정수,실수,문자,논리 리터럴을 저장하는 타입
  -byte, char, short, int, long, float, double, boolean

  2)참조타입
  -객체(Object)의 번지(주소값)를 참조하는 타입으로 배열, 열거, 클래스, 인터페이스 타입

  *기본타입과 참조타입의 차이는 저장되는 값이 무엇이냐이다.
  *기본타입을 이용하여 선언된 변수는 실제 값을 변수 안에 저장하지만,
  *참조 타입을 이용하여 선언된 변수는 메모리의 주소값을 값으로 갖는다.
  *주소값을 통해 객체를 참조한다는 뜻에서 참조타입이라고 부른다.

  ----------------------------------------------------------------------------
  *변수는 스택 영역에 생성되고 객체는 힙 영역에 생성된다.
  1) int age = 25; double price = 100.5; 같은 구문의 변수인 age와 price는 직접 값을 저장하고 있지만,
  2) String name = "이용민"; String hobby = "독서"; 의 변수인 name과 hobby는 힙 영역의
  String 객체 주소값을 가지고 있다.
  * 주소를 통해 객체를 참조한다는 뜻에서 String 클래스 변수를 참조 타입 변수라고 한다.
  *


























































  */


}
